#### SetCellType Method (Int32, Int32, CellType)

---

|  |
| --- |
| TableSectionData Class   See Also |

Sets a cell's Type

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetCellType( 	int nRow, 	int nCol, 	CellType type ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetCellType ( _ 	nRow As Integer, _ 	nCol As Integer, _ 	type As CellType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetCellType( 	int nRow,  	int nCol,  	CellType type ) ``` |

#### Parameters

nRow
:   Type:  System Int32

nCol
:   Type:  System Int32

type
:   Type:  Autodesk.Revit.DB CellType

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | This operation is forbidden for cells in standard schedule body sections. |

# See Also

TableSectionData Class

SetCellType Overload

Autodesk.Revit.DB Namespace